package com.labrab7.task2;

/**
 * Вариант №2: <strong>Н-фрактал</strong> <hr>
 * Реализовать построение заданного типа фрактала по варианту.
 * Везде, где это необходимо, предусмотреть ввод параметров, влияющих на внешний вид фрактала.
 * Н-фрактал
 */
public class Main
{
    public static void main(String[] args)
    {
        System.out.println("Hello world!");
    }
}
