package com.labrab7.task1;

/**
 * Вариант №2 <hr>
 * Реализовать соответствующие классы, указанные в задании;
 * Организовать ввод параметров для создания объектов (можно использовать файлы);
 * Осуществить визуализацию графических примитивов, решить поставленную задачу
 * <hr>
 * Определить класс Rectangle и класс Point. Объявить массив из n объектов класса Point.
 * Написать функцию, определяющую, какая из точек лежит снаружи, а какая – внутри прямоугольника.
 */
public class Main
{
    public static void main(String[] args)
    {
        System.out.println("Hello world!");
    }
}
