package SPP.s2labrab1;

/**
 * Вариант 2 <br>
 * Напишите программу, которая вводит строку текста,
 * разбивает ее на лексемы выводит лексемы в обратном порядке.
 */
public class Task1
{
    public static void main(String[] args)
    {
        System.out.println("Hello world!");
    }
}
